import { createSlice } from "@reduxjs/toolkit";

const initState = {

    0: {
        "id": 0,
        "title": "ایران ۲- ولز صفر/ برد شیرین ایران در جام جهانی 2022",
        "content": "دیدار دوم تیم ملی فوتبال ایران در مرحله گروهی جام جهانی مقابل ولز که عصر جمعه برگزار شد با نتیجه ۲ بر صفر به سود ایران به پایان رسید. تیم‌های ایران و ولز در ورزشگاه احمد بن علی در چارچوب هفته دوم مرحله گروهی رقابت‌های جام جهانی ۲۰۲۲ قطر از گروه B به مصاف یکدیگر رفتند و در نهایت این دیدار با نتیجه دو بر صفر به سود ایران به پایان رسید کارلوس کی‌روش سرمربی تیم ملی فوتبال ایران در این خصوص گفت: در تیم ما وحدت خوبی ایجاد شد و امروز به ریشه‌های خود بازگشتیم.",
        "date": 1669461630123,
        "user": 0
    },

    1: {
        "id": 1,
        "title": "هابل لحظه برخورد دو کهکشان را ثبت کرد.",
        "content": "با وجود اینکه از زمان آغاز به کار تلسکوپ فضایی جیمز وب همه توجهات به این رصدخانه معطوف شده است، هابل همچنان به ثبت تصاویر دیدنی خود می‌پردازد. این تلسکوپ اخیراً تصویری از یک برخورد کهکشانی عجیب‌وغریب ثبت کرده است که در فاصله 670 میلیون سال نوری از زمین قرار دارد.   کشمکش گرانشی این دو کهکشان شکل عجیبی شبیه یک حلقه را به وجود آورده که در آن هسته‌های این دو کهکشان نسبتاً نزدیک یکدیگر به‌نظر می‌رسند و دنباله آنها تشکیل یک دایره را داده است. تلسکوپ هابل این تصویر را با دوربین پیشرفته خود گرفته که پیش‌تر توانسته بود به شناسایی ماده تاریک کمک کند.  این برخورد با نام Arp-Madore 417-391 در صورت فلکی جوی (Eridanus) در نیم‌کره سماوی جنوبی قرار گرفته است. تصویر حاضر اثر قدرتمند گرانش بر کهکشان‌های بزرگی را نشان می‌دهد که با مجموعه اجرام خود در حال ادغام‌شدن با یکدیگر هستند. دانشمندان در چند وقت اخیر از این رصدخانه به‌منظور شناسایی سوژه‌های تصویربرداری برای تلسکوپ جیمز وب استفاده کرده‌اند. حالا باید منتظر باشیم تا قدرتمندترین تلسکوپ فضایی جهان به بررسی دقیق‌تر این برخورد بپردازد و ببینیم چه اطلاعات بیشتری می‌توان از این پدیده دریافت کرد.",
        "date": 1664829478451,
        "user": 1
    },
    2: {
        "id": 2,
        "title": "بزرگترین دنباله‌دار تاریخ نجوم به طرف خورشید در حال حرکت است/ آیا باید نگران بود؟",
        "content": "بی بی سی نوشت:دنباله‌داری که ابعاد هسته مرکزی آن ۵۰ برابر معمول است با سرعت ۳۵ هزار کیلومتر در ساعت به طرف خورشید در حرکت است. اما جای نگرانی نیست. این جرم از یک میلیارد و ۶۰۰ میلیون کیلومتری به خورشید نزدیکتر نخواهد شد، آن هم در سال ۲۰۳۱. فاصله زمین از خورشید ۱۵۰ میلیون کیلومتر است بنابراین به زمین هم نزدیک نمی‌شود. این دنباله‌دار ابتدا در سال ۲۰۱۰ شناسایی شد اما هابل تازه ابعاد واقعی آن را تایید کرده است. این بزرگترین دنباله‌داری است که منجمان تاکنون رصد کرده‌اند. دیوید جوئیت، استاد علوم سیارات و ستاره شناسی در دانشگاه کالیفرنیا در لس آنجلس (یو سی ال اِی) می گوید: همیشه مظنون بودیم که این دنباله‌دار باید بزرگ باشد چون از این فاصله دور هم درخشان است. ما حالا این موضوع را تایید کرده‌ایم. ",
        "date": 1650758057143,
        "user": 1
    },
    3: {
        "id": 3,
        "title": "اطلاعات و معرفی اوپنهایمر کریستوفر نولان",
        "content": "اوپنهایمر (انگلیسی: Oppenheimer)، یک فیلم رو به اکران بریتانیایی آمریکایی در ژانر حماسی زندگینامه‌ای به نویسندگی، تهیه‌کنندگی و کارگردانی کریستوفر نولان است که در سال ۲۰۲۳ اکران خواهد شد. نولان فیلم‌نامه این فیلم را بر اساس کتاب پرومته آمریکایی، پیروزی و تراژدی جی رابرت اوپنهایمر به رشته تحریر درآورده است. داستان فیلم دربارهٔ زندگی رابرت اوپنهایمر، فیزیکدان نظری آمریکایی است که به عنوان «پدر بمب اتمی» شناخته شده‌است. کیلین مورفی نقش اوپنهایمر را در فیلم بازی خواهد کرد. امیلی بلانت، رابرت داونی جونیور و مت دیمون نیز به‌ترتیب در نقش کاترین اوپنهایمر، لوئیس اشتراوس و لسلی گرووز حضور دارند.در دسامبر ۲۰۲۱ حضور فلورنس پیو، رامی ملک و بن سفدی تأیید شد.  همچون آثار قبلی نولان، اوپنهایمر نیز با فرمت ۷۰ میلی‌متری و به صورت آی‌مکس ساخته خواهد شد. نولان بعد از نزدیک به دو دهه همکاری و ساخت ۹ فیلم برای برادران وارنر به علت اختلاف در زمینه اکران سینمایی با این شرکت قطع همکاری کرد. بعد از انجام مذاکرات، یونیورسال پیکچرز حق ساخت و پخش جهانی فیلم را خرید. تاریخ نمایش عمومی فیلم اوپنهایمر نولان -که حدود ۲ هفته پیش از سالروز انداختن بمب اتم روی هیروشیما است- تقریباً همان زمان اکران همیشگی فیلم‌های نولان در اواسط ماه ژوییه و اکران تابستانی مختص اوست. پیش از این، شوالیه تاریکی، تلقین، شوالیه تاریکی برمی‌خیزد و دانکرک در همین آخرهفته از ماه ژوییه اکران شده بودند و سینماروها و علاقه‌مندان هم با استقبال گسترده خود این فیلم‌ها را ستوده بودند که یعنی در تاریخ ۲۱ ژوئیه ۲۰۲۳ به روی پرده سینما خواهد رفت.",
        "date": 1659731468322,
        "user": 2
    },
    4: {
        "id": 4,
        "title": "اقدام شگفت انگیز یک جوان ۱۸ ساله در ماینکرفت",
        "content": "یک جوان ۱۸ ساله دو ماه را صرف خلق و به اشتراک گذاشتن کل جهانِ قابل مشاهده در یک بازی رایانه‌ای موسوم به ماینکرفت کرده است که در آن می‌توان تقریباً هر چیزی را ساخت.  کریستوفر اسلایتون ۱۸ ساله، یکی از علاقه‌مندان قدیمی بازی ماینکرفت است. این بازی به کاربران اجازه می‌دهد قلعه‌ها، صخره‌ها و اشیای دیگر را به دلخواه خود با استفاده از آجرهای قدیمی بسازند، اما اسلایتون تلاش خود را برای خلق چیزی بسیار بیشتر و بزرگتر به کار بست. و سیاه‌چاله‌ها، ستاره‌ها و کهکشان‌ها را با استفاده از رایانه شخصی خود ایجاد کرد و نتایج حماسی کار خود را در یوتیوب به اشتراک گذاشت.   ماینکرفت یک بازی جهان‌باز است که توسط موجنگ استودیوز ساخته و برای رایانه و موبایل منتشر شده‌ است. این بازی توسط مارکوس پرسون خلق و با زبان برنامه‌نویسی جاوا نوشته شده‌ است.   در ماینکرفت، بازیکنان در دنیای سه بعدی تولید شده، زمینی تقریباً بی‌نهایت را کاوش می‌کنند و ممکن است مواد اولیه، ابزارها و وسایل را کشف یا استخراج کنند که با استفاده از آنها سازه‌های مختلف و متفاوتی بسازند. بسته به حالت بازی، بازیکنان می‌توانند منابعی را برای ساختن جهان و حفظ سلامتی خود بدست آورند و یک حالت خلاقانه که بازیکنان منابع و جان نامحدود دارند و می‌توانند پرواز کنند در آن وجود دارد.  بازی ماینکرفت به هیچ وجه یک بازی فضایی سنتی نیست، اما چیزی که اسلایتون پیاده‌سازی کرده و به اشتراک گذاشته است، به نظر می‌رسد که آن را در میان بهترین بازی‌های کاوش فضایی قرار می‌دهد. ویدیویی که او به اشتراک گذاشته در حال حاضر نزدیک به یک میلیون بازدید داشته است.",
        "date": 1665985828062,
        "user": 1
    },
    5: {
        "id": 5,
        "title": "معرفی و بررسی سریال The Boys ؛ قهرمانان دروغین!!!",
        "content": "قهرمانان این دنیا جوری هستن که حتما موقع تماشای سریال با خودتون میگید که اگه واقعا ابرقهرمانان وجود داشتن اینجوری میشدن و همونجا خدا رو شکر میکنید که توی دنیای خودمون حداقل فعلا خبری از ابرقهرمان نیست. قدرت های بیشتر ابرقهرمانان سریال از روی شخصیت های کمپانی DC الهام گرفته شده. هوملندر، رهبر گروه اصلی ابرقهرمانان و محبوب‎ترین ابرقهرمان از نظر مردم که امکان نداره که با دیدنش یاد سوپرمن نیوفتید. قهرمانی خوش خنده و جذاب با قدرت‎های بینهایت زیاد که تقریبا هیچ حد و مرزی برای خودش قائل نیست و خودش رو برتر از انسان‎ های عادی میدونه. البته که توی سریال قهرمانانی هستن که واقعا دوست دارن به مردم کمک کنن و فقط به فکر خودشون نیستن مثل استارلایت. دختر جوانی که از بچگی با فکر اینکه قدرتش توسط خدا به اون داده شده بزرگ شده و رویای یک قهرمان خوب شدن رو داشته که به مردم کمک کنه. وقتی استارلایت بالاخره وارد جامعه‎ی ابرقهرمانان میشه با افرادی فاسدی روبرو میشه که اون رو کاملا دلسرد میکنه. اگه به سریال دقت کنید میتونید شباهت‎ هایی بین اون و دنیای خودمون پیدا کنید مثل اینکه توی دنیای خودمون هم افرادی هستن که توی روی مردم میخندن و مردم باهاشون عکس میندازن ولی در پشت پرده زمانی که مردم خبر ندارن اونا هر کاری میکنن و اصلا براشون اهمیتی نداره که به کسی آسیب میرسه یا نه. بازیگران سریال هم عملکرد خیلی خوبی دارند و میشه گفت همه‎ی اونا توی ایفای نقش‎های خودشون موفق عمل کردن.  در رأس اونها هم آنتونی استار در نقش هوملندر که واقعا حقیقت این شخصیت و اینکه به هیچ اصول اخلاقی پایبند نیست رو به خوبی به تصویر میکشه و همینطور کارل اربن در نقش بوچر که به خوبی نقش فردی بد دهن و متنفر از ابرقهرمانان رو بازی میکنه که برای رسوا کردن ابرقهرمانان دست به هر کاری میزنه.   در پایان معرفی و بررسی سریال the boys بگم که اگر از کسانی هستید که به ژانر ابرقهرمانی علاقه دارید و همینطور دوست دارید که کمی از کلیشه‎ های این ژانر فاصله بگیرید یا اینکه اصلا به این ژانر علاقه ندارید اما دوست دارید که یک سریال با موضوعی جدید و متفاوت ببینید، این سریال رو از دست ندید. تا یادم نرفته بگم که این سریال خشونت زیادی داره و برای هر سنی مناسب نیست.",
        "date": 1660698328119,
        "user": 2
    },
    6: {
        "id": 6,
        "title": "دستت به مسی بخورد با من طرفی!",
        "content": "هرجا که پای بوکس و هیاهو در میان باشد، مایک تایسون هم هست. او در پی جنجال های پس از بازی آرژانتین - مکزیک، کانلو بوکسور مکزیکی را تهدید کرد. به گزارش ورزش سه، ماجرا از جایی شروع شد که پای مسی حین درآوردن کفش در جشن پیروزی بازیکنان آرژانتین مقابل مکزیک پایش به پیراهن مکزیک که روی زمین افتاده بود برخورد کرد؛ این اتفاق واکنش‌های بسیاری داشت که مهمترین و شدیدترین آن، تهدید مسی توسط کانلو آلوارز، بوکسور اهل مکزیک بود. او در ادامه نیز پستی جعلی و جنجالی منتشر کرد و به شدت ماجرا افزود.  اگرچه کانلو بعد از این جنجال‌ها از مسی و آرژانتینی‌ها عذرخواهی کرد، اما داستان هنوز متوقف نشده است. این بار نوبت مایک تایسون افسانه ای بود که پیام کوچکی برای مرد اهل گوادالاخارا فرستاد. این بوکسور بازنشسته که افتخارات بسیاری در دوران حرفه‌ای خود به جای گذاشته است، با اعلام حمایت خود از ستاره تیم ملی آرژانتین، در صورت حمله به او، پیشنهاد داد تا از مسی دفاع کند. تایسون در گفت و گویی به این موضوع اشاره و تهدید کرد: اگر کانلو جرات کند و مسی را لمس کند، باید بعد از سال‌ها به رینگ برگردم و جوابش را بدهم! این بوکسور 56 ساله در 58 مباره خود 50 بار پیروز شد و تنها 6 بار طعم باخت را چشید و در سال 2005 با رینگ خداحافظی کرد. جالب است بدانید که او 44 برد از این 50 تا را با ناک‌اوت به پایان رساند و نامش را در تاریخ جاودانه کرد. همین موضوع باعث شده تا این تهدید که البته خیلی هم جدی به نظر نمی‌رسد، مورد توجه رسانه‌های کل دنیا قرار گرفته و حتی برای ساعاتی، توجهات را به خود جلب کند. در همین حال، کانلو در رسانه ای که دعوا شروع و بالا گرفت (توئیتر)، بعدا عذرخواهی کرد. او در متن عذرخواهی خود قبول کرد که این واکنش غیرعادی را صرفا به خاطر و علاقه و عشق بالایی که به کشورش مکزیک دارد انجام داده است: من به خاطر اظهارات نامناسبی که داشتم از مسی و مردم آرژانتین عذرخواهی می کنم.  برای هر دو تیم آرزوی موفقیت در جام جهانی دارم.",
        "date": 1669806794465,
        "user": 4
    },
    7: {
        "id": 7,
        "title": "اضافه شدن نادر شاه ایران به بازی Civilization 6",
        "content": "قرار است سیزن پس جدیدی برای بازی Civilization 6 با نام لیدر پس عرضه شود که طی آن شاهد هجده رهبر قابل انتخاب خواهیم بود. هفته پیش بود که اطلاعات سیزن پس جدید Civilization 6 لو رفت و اکنون شرکت 2K Games به صورت رسمی از آن رونمایی کرده است. این سیزن پس با نام لیدر پس، دوازده رهبر جدید و شش برداشت جدید از رهبرهای کنونی را شامل خواهد شد؛ تا درمجموع تعداد لیدرهای آن به ۱۸ رهبر قابل بازی جدید برسد که طی شش بسته الحاقی عرضه خواهند شد.   این لیدر پس برای دارندگان کنونی و جدید Civilization 6 Anthology روی فروشگاه استیم و فروشگاه اپیک رایگان خواهد بود. هر رهبر با قابلیت‌های جدید یا ارتقایافته در کنار برنامه‌های مبتکرانه‌ای عرضه خواهد شد که روش بازی شما طی بیش از پنج ماه سلطه‌ی جهانی را تغییر خواهد داد. این شش DLC از روز ۳۰ آبان (۲۱ نوامبر) تا مارس ۲۰۲۳ منتشر خواهد شد. ",
        "date": 1666624004760,
        "user": 0
    }
}

var ks = Object.values(initState).sort((a, b) => { return b.date - a.date })



const postSLice = createSlice({
    name: "posts",
    initialState: Object.assign({}, ks),
    reducers: {}
})



export default postSLice.reducer